personal/my-routine-planning.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-05-01 Thu 18:20 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Personal Routine Planning</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/theme/style.css" />
</head>
<body>
<div id="preamble" class="status">
<header>
  <h1><a href="/">thisago's blog</a></h1>
</header>
</div>
<div id="content" class="content">
<h1 class="title">My Personal Routine Planning</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgedb275b">Intro</a></li>
<li><a href="#org14a7c6a">The Plan</a>
<ul>
<li><a href="#orgfa37136">Intention&#xa0;&#xa0;&#xa0;<span class="tag"><span class="summary">summary</span></span></a></li>
<li><a href="#orgc705b08">Keep In Mind</a>
<ul>
<li><a href="#org46f992b">Expected Overcomes &amp; Values</a></li>
<li><a href="#orgbf70082">Considerations</a></li>
<li><a href="#orge26fead">Static Inflexibility</a></li>
<li><a href="#orgcef862e">Known Issues</a></li>
</ul>
</li>
<li><a href="#org31d4ef4">Ideas</a></li>
<li><a href="#org680f699">Scratching The Plan</a>
<ul>
<li><a href="#org472d6bb">Tasks Overview</a></li>
<li><a href="#org4a8d64d">Idealizations</a></li>
<li><a href="#org853b3ef">Theories</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgedb275b" class="outline-2">
<h2 id="orgedb275b">Intro</h2>
<div class="outline-text-2" id="text-orgedb275b">
<p>
I was thinking through words earlier on what's wrong on my routine planning this morning and I realized it can be a great manner to start my public <a href="https://swyx.io/digital-garden-tos">digital garden ↗</a>.
</p>

<p>
So below is my planning.
</p>
</div>
</div>


<div id="outline-container-org14a7c6a" class="outline-2">
<h2 id="org14a7c6a">The Plan</h2>
<div class="outline-text-2" id="text-org14a7c6a">
</div>
<div id="outline-container-orgfa37136" class="outline-3">
<h3 id="orgfa37136">Intention&#xa0;&#xa0;&#xa0;<span class="tag"><span class="summary">summary</span></span></h3>
<div class="outline-text-3" id="text-orgfa37136">
<p>
The goal is aggregate all I need to build a good routine:
</p>
<ul class="org-ul">
<li>Values</li>
<li>Expected Overcomes</li>
<li>Notion of Time Blocking</li>
</ul>
</div>
</div>


<div id="outline-container-orgc705b08" class="outline-3">
<h3 id="orgc705b08">Keep In Mind</h3>
<div class="outline-text-3" id="text-orgc705b08">
</div>
<div id="outline-container-org46f992b" class="outline-4">
<h4 id="org46f992b">Expected Overcomes &amp; Values</h4>
<div class="outline-text-4" id="text-org46f992b">
<dl class="org-dl">
<dt>Organized Mind</dt><dd>Stop worrying on "what's next".</dd>
<dt>Make Life Pleasant</dt><dd>The "want more" taste in the end of the day.</dd>
<dt>Time Is Short</dt><dd>Wasting time isn't a option.</dd>
<dt>Procrastination Is A Sign</dt><dd>Reduce the tasks load by interpolating with light and enjoyable tasks.</dd>
<dt>Reduce Decision Making</dt><dd>Need to think on what to do next wastes your energy.</dd>
<dt>Eat The Frog From The Morning</dt><dd>The chaos should be taken on the morning, where you're full of energy.</dd>
</dl>
</div>
</div>

<div id="outline-container-orgbf70082" class="outline-4">
<h4 id="orgbf70082">Considerations</h4>
<div class="outline-text-4" id="text-orgbf70082">
<p>
Since the start time of the day changes accordingly my needs and desires, I'll be time-agnostic.
</p>

<p>
The below visualizations considers:
</p>
<ul class="org-ul">
<li>We need 8h of rest.</li>
<li>We have a available time-span of <code>16</code> hours.</li>
<li>I'll allocate at least 6h of work.</li>
<li>I need pauses on work to avoid procrastination.</li>
</ul>
</div>
</div>

<div id="outline-container-orge26fead" class="outline-4">
<h4 id="orge26fead">Static Inflexibility</h4>
<div class="outline-text-4" id="text-orge26fead">
<dl class="org-dl">
<dt>Mon-Fri 8:30AM-9:00AM</dt><dd>Point Daily</dd>
<dt>Sun-Sat 4PM-5PM</dt><dd>Daily call with my best friend</dd>
<dt>Sat 10AM-12PM</dt><dd>Call on friends' studies group</dd>
</dl>
</div>
</div>

<div id="outline-container-orgcef862e" class="outline-4">
<h4 id="orgcef862e">Known Issues</h4>
<div class="outline-text-4" id="text-orgcef862e">
<ul class="org-ul">
<li>Extend the refections due distractions (such audiobooks or social interactions).</li>
<li>Dive into hype and ignore the other tasks.</li>
<li>Procrastinate on work due lack of breaks.</li>
<li>Lack of the habit to say <b>NO</b>, overloading myself at work.
<ul class="org-ul">
<li>New tasks aren't a break from your previous responsibility.</li>
</ul></li>
<li>Overthinking on changing tasks.</li>
<li>Checking agenda and daily plan is currently a struggle. It should be easy as <code>Alt+Tab</code>.</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org31d4ef4" class="outline-3">
<h3 id="org31d4ef4">Ideas</h3>
<div class="outline-text-3" id="text-org31d4ef4">
<ul class="org-ul">
<li>The Pomodoro break could be:
<ul class="org-ul">
<li>Reading a book.</li>
<li>Hearing a audiobook, taking it from refections.</li>
<li>Learning a new thing.</li>
<li>Talk with others via messaging.</li>
</ul></li>
</ul>
</div>
</div>


<div id="outline-container-org680f699" class="outline-3">
<h3 id="org680f699">Scratching The Plan</h3>
<div class="outline-text-3" id="text-org680f699">
<p>
This is my personal planning, use it as inspiration!
</p>
</div>
<div id="outline-container-org472d6bb" class="outline-4">
<h4 id="org472d6bb">Tasks Overview</h4>
<div class="outline-text-4" id="text-org472d6bb">
<ol class="org-ol">
<li><code>REQUI</code> Wake up and prepare
<ul class="org-ul">
<li>Exit bedroom</li>
<li>Caffeine</li>
<li>Eat</li>
<li>Exercises</li>
</ul></li>
<li><code>IDEAL</code> Plan the day</li>
<li><code>IDEAL</code> Technical study on other areas
<ul class="org-ul">
<li>Bible</li>
<li>Psychology</li>
</ul></li>
<li><code>REQUI</code> Work @8h30min</li>
<li><code>IDEAL</code> Lunch @12h</li>
<li><code>IDEAL</code> Work @13h</li>
<li><code>REQUI</code> Reflections with my friend @16h</li>
<li><code>IDEAL</code> Finish the day report</li>
<li><code>REQUI</code> Shutting down
<ul class="org-ul">
<li>Patch timeto.me export with the updated routine for tomorrow</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org4a8d64d" class="outline-4">
<h4 id="org4a8d64d">Idealizations</h4>
<div class="outline-text-4" id="text-org4a8d64d">
<ul class="org-ul">
<li>Finish the work before the call with my friend.</li>
<li>Be able to do the morning tasks.</li>
<li>Take the last bath to break thirdwork tension.</li>
</ul>
</div>
</div>

<div id="outline-container-org853b3ef" class="outline-4">
<h4 id="org853b3ef">Theories</h4>
<div class="outline-text-4" id="text-org853b3ef">
<ul class="org-ul">
<li>If I skip day idealization, that "saved time" will be spent on a existential crisis session. Keep the mind healthy is not a optional thing.</li>
<li>Instead of considering work blocks as thirdwork-only, I can do my work tasks on there, taking advantage of the inertia already obtained from the coding process.</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
See the source code <a href="https://github.com/thisago/blog">here</a>.
</div>
</body>
</html>
